---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldPitch
source: html/ef22e479-ccf0-a5e8-c84b-2be59d70ba6f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldPitch Property

"Pitch"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldPitch { get; }
```